package com.su.koenawin.ui.feature.setting

import androidx.compose.runtime.Composable
import com.su.koenawin.ui.feature.mittar.ParagraphView

@Composable
fun SettingScreen() {
    ParagraphView(text = "မေတ္တာပို့\n+" +
            "၁။ လုံးစုံများစွာ ၊ သတ္တဝါ ၊\n" +
            "ချမ်းသာကိုယ်စိတ် မြဲပါစေ ။\n" +
            "ဥပါဒ်ရန်ဘေး ၊ ကင်းစင်ဝေး\n" +
            "ငြိမ်းအေးကြပါစေ။ \n" +
            "၂။ ကြောက်တတ် မကြောက်တတ် ၊ \n" +
            "နှစ်ရပ်များစွာ ၊ သတ္တဝါ ၊\n" +
            "ချမ်းသာကိုယ်စိတ် မြဲပါစေ ။\n" +
            "ဥပါဒ်ရန်ဘေး ၊ ကင်းစင်ဝေး ၊\n" +
            "ငြိမ်းအေးကြပါစေ။ \n" +
            "၃။ မြင်အပ် မမြင်အပ် ၊ \n" +
            "နှစ်ရပ်များစွာ ၊ သတ္တဝါ ၊ \n" +
            "ချမ်းသာကိုယ်စိတ် မြဲပါစေ ။ \n" +
            "ဥပါဒ်ရန်ဘေး ၊ ကင်းစင်ဝေး ၊\n" +
            "ငြိမ်းအေးကြပါစေ။ \n" +
            "၄။ ဝေးနေ နီးနေ ၊ \n" +
            "နှစ်ထွေများစွာ ၊ သတ္တဝါ ၊ \n" +
            "ချမ်းသာကိုယ်စိတ် မြဲပါစေ ။ \n" +
            "ဥပါဒ်ရန်ဘေး ၊ ကင်းစင်ဝေး ၊\n" +
            "ငြိမ်းအေးကြပါစေ။\n" +
            "၅။ ဘ၀ဇာတ်ဆုံး ၊ \n" +
            "မဆုံးများစွာ ၊ သတ္တဝါ ၊ \n" +
            "ချမ်းသာကိုယ်စိတ် မြဲပါစေ ။\n" +
            "ဥပါဒ်ရန်ဘေး ၊ ကင်းစင်ဝေး ၊\n" +
            "ငြိမ်းအေးကြပါစေ။\n" +
            "၆။ ရှည်-တို-အလတ် ၊ \n" +
            "သုံးရပ်ခန္ဓာ ၊ သတ္တဝါ ၊ \n" +
            "ချမ်းသာကိုယ်စိတ် မြဲပါစေ ။ \n" +
            "ဥပါဒ်ရန်ဘေး ၊ ကင်းစင်ဝေး ၊ \n" +
            "ငြိမ်းအေးကြပါစေ။\n" +
            "၇။ ကြီး-ငယ်-အလတ် ၊ \n" +
            "သုံးရပ်ခန္ဓာ ၊ သတ္တဝါ ၊\n" +
            "ချမ်းသာကိုယ်စိတ် မြဲပါစေ ။\n" +
            "ဥပါဒ်ရန်ဘေး ၊ ကင်းစင်ဝေး ၊\n" +
            "ငြိမ်းအေးကြပါစေ။ \n" +
            "၈။ ဆူ-ကြုံ-အလတ် ၊ \n" +
            "သုံးရပ်ခန္ဓာ ၊ သတ္တဝါ ၊ \n" +
            "ချမ်းသာကိုယ်စိတ် မြဲပါစေ ။\n" +
            "ဥပါဒ်ရန်ဘေး ၊ ကင်းစင်ဝေး ၊ \n" +
            "ငြိမ်းအေးကြပါစေ။\n" +
            "၉။ လူအချင်းချင်း ၊ လှည့်ပတ်ခြင်း ၊ \n" +
            "ကင်းရှင်းကြပါစေ။\n" +
            "၁၀။ အထင်သေးခြင်း ၊ အချင်းချင်း ၊\n" +
            "ကင်းရှင်းကြပါစေ။\n" +
            "၁၁။ ဆင်းရဲလိုခြင်း ၊ အချင်းချင်း ၊ \n" +
            "ကင်းရှင်းကြပါစေ။\n" +
            "\uD83D\uDE4Fအရှေ့ အရပ်၌ရှိသော\n" +
            "[10:43 pm, 11/06/2023] Su: အနန္တ စကြဝဠာ အနန္တ သတ္တဝါတို့...\n" +
            "ဘေးရန်ခပ်သိမ်းငြိမ်းကြပါစေ ၊ \n" +
            "ဒေါသခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "ဆင်းရဲခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "နှလုံးစိတ်ဝမ်း အေးချမ်းကြပါစေ။\n" +
            "\uD83D\uDE4Fအနောက်အရပ်၌ ရှိသော \n" +
            "အနန္တ စကြဝဠာ အနန္တ သတ္တဝါတို့...\n" +
            "ဘေးရန်ခပ်သိမ်းငြိမ်းကြပါစေ ၊\n" +
            "ဒေါသခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "ဆင်းရဲခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "နှလုံးစိတ်ဝမ်း အေးချမ်းကြပါစေ။\n" +
            "\uD83D\uDE4Fမြောက်အရပ်၌ရှိသော \n" +
            "အနန္တ စကြဝဠာ အနန္တ သတ္တဝါတို့...\n" +
            "ဘေးရန်ခပ်သိမ်းငြိမ်းကြပါစေ ၊ \n" +
            "ဒေါသခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "ဆင်းရဲခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "နှလုံးစိတ်ဝမ်း အေးချမ်းကြပါစေ။\n" +
            "\uD83D\uDE4Fတောင်အရပ်၌ရှိသော \n" +
            "အနန္တ စကြဝဠာ အနန္တ သတ္တဝါတို့...\n" +
            "ဘေးရန်ခပ်သိမ်းငြိမ်းကြပါစေ ၊\n" +
            "ဒေါသခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "ဆင်းရဲခပ်သိမ်း ငြိမ်းကြပါစေ ၊\n" +
            "နှလုံးစိတ်ဝမ်း အေးချမ်းကြပါစေ။\n" +
            "\uD83D\uDE4Fအရှေ့ တောင်ထောင့်အရပ်၌ရှိသော \n" +
            "အနန္တ စကြဝဠာ အနန္တ သတ္တဝါတို့...\n" +
            "ဘေးရန်ခပ်သိမ်းငြိမ်းကြပါစေ ၊ \n" +
            "ဒေါသခပ်သိမ်းငြိမ်းကြပါစေ ၊ \n" +
            "ဆင်းရဲခပ်သိမ်းငြိမ်းကြပါစေ ၊ \n" +
            "နှလုံးစိတ်ဝမ်း အေးချမ်းကြပါစေ။\n" +
            "\uD83D\uDE4Fအနောက်မြောက်ထောင့်အရပ်၌ရှိသော \n" +
            "အနန္တ စကြဝဠာ အနန္တ သတ္တဝါတို့...\n" +
            "ဘေးရန်ခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "ဒေါသခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "ဆင်းရဲခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "နှလုံးစိတ်ဝမ်း အေးချမ်းကြပါစေ။\n" +
            "\uD83D\uDE4Fအရှေ့မြောက်ထောင့်အရပ်၌ရှိသော \n" +
            "အနန္တ စကြဝဠာ အနန္တ သတ္တဝါတို့...\n" +
            "ဘေးရန်ခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "ဒေါသခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "ဆင်းရဲခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "နှလုံးစိတ်ဝမ်း အေးချမ်းကြပါစေ။\n" +
            "\uD83D\uDE4Fအနောက်တောင်ထောင့်အရပ်၌ရှိသော \n" +
            "အနန္တ စကြဝဠာ အနန္တ သတ္တဝါတို့ \n" +
            "ဘေးရန်ခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "ဒေါသခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "ဆင်းရဲခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "နှလုံးစိတ်ဝမ်း အေးချမ်းကြပါစေ။\n" +
            "\uD83D\uDE4Fအောက်အရပ်၌ရှိသော \n" +
            "ထက်ဝန်းကျင် အနန္တ စကြဝဠာ \n" +
            "အပါယ်ဘုံသား အနန္တ သတ္တဝါတို့...\n" +
            "ဘေးရန်ခပ်သိမ်းငြိမ်းကြပါစေ \n" +
            "ဒေါသခပ်သိမ်း ငြိမ်းကြပါစေ \n" +
            "ဆင်းရဲခပ်သိမ်း ငြိမ်းကြပါစေ \n" +
            "နှလုံးစိတ်ဝမ်း အေးချမ်းကြပါစေ။\n" +
            "\uD83D\uDE4Fအထက်အရပ်၌ရှိသော \n" +
            "ထက်ဝန်းကျင် အနန္တ စကြဝဠာ \n" +
            "အနန္တ နတ်ဗြဟ္မာတို့....\n" +
            "ဘေးရန်ခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "ဒေါသခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "ဆင်းရဲခပ်သိမ်း ငြိမ်းကြပါစေ ၊ \n" +
            "နှလုံးစိတ်ဝမ်း အေးချမ်းကြပါစေ။\n" +
            "\uD83D\uDE4F\uD83D\uDE4F\uD83D\uDE4F\uD83D\uDE4F\uD83D\uDE4F")
}